XuLibo1129/zhi-hu-an-ju-health-guardian/firmware/ld6002c-node/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 boards in this project report rev v1.x.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Waveshare ESP32-P4-WIFI6 uses hosted Wi-Fi through its on-board ESP32-C6.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

CONFIG_APP_WIFI_SSID=""
CONFIG_APP_WIFI_PASSWORD=""
CONFIG_APP_MAIN_TERMINAL_URL="http://192.168.1.100:8090/api/sensor/ld6002c"
CONFIG_APP_NODE_ID="ld6002c_01"
CONFIG_APP_LD6002C_UART_NUM=1
CONFIG_APP_LD6002C_UART_TX_GPIO=23
CONFIG_APP_LD6002C_UART_RX_GPIO=22
CONFIG_APP_LD6002C_UART_BAUD=115200
CONFIG_APP_LD6002C_TX2_GPIO=-1
CONFIG_APP_REPORT_INTERVAL_MS=2000
